<font color='green'>

## 15. apply()

### Tıpkı 'filter' ve 'transform' fonksiyonları gibi dataframe'in değişkenlerinin üzerinde gezinme yeteneği olan ve aggregetion yani toplulaştırma özelliği olan bir fonksiyondur.

In [5]:
import pandas as pd
import numpy as np

In [3]:
dataf=pd.DataFrame({'degisken1' : [10,23,33,22,11,99],
		      'degisken2' : [100,253,333,262,111,969]},
		      columns = ['degisken1','degisken2'])
dataf

   degisken1  degisken2
0         10        100
1         23        253
2         33        333
3         22        262
4         11        111
5         99        969

### Değisken1 ve Degisken2 ' nin toplamlarını alalım.

In [6]:
dataf.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

### Degisken1 ve Degisken2 ' nin ortalamalarını alalım.

In [7]:
dataf.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

### Şimdi aynı işlemi klasik örneğimizde inceleyelim. ('gruplar') ı geri getirdik.

In [9]:
dataf=pd.DataFrame({'gruplar': ['A','B','C','A','B','C'],
		      'degisken1' : [10,23,33,22,11,99],
		      'degisken2' : [100,253,333,262,111,969]},
		      columns = ['gruplar','degisken1','degisken2'])
dataf

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

### 'gruplar' değişkenine göre gruplara bölüp her bir grup için bu işlemi gerçekleştirdi.

In [11]:
dataf.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

In [12]:
dataf.groupby("gruplar").apply(np.mean)

         degisken1  degisken2
gruplar
A             16.0      181.0
B             17.0      182.0
C             66.0      651.0

### 'gruplar' değişkenine göre gruplara bölüp her bir grup için bu işlemi gerçekleştirdi.

### [16. Pivot Tablolar notlarına geçmek için tıklayınız.](https://github.com/semihstp/Veri-Bilimi-Not-Defterim/blob/master/Pandas%20K%C3%BCt%C3%BCphanesi/16.%20Pivot%20Tablolar.ipynb)